espressif/esp-idf/components/soc/esp32s2/register/soc/ledc_reg.h
#define LEDC_INT_ENA_REG          (DR_REG_LEDC_BASE + 0x00c8)
/* LEDC_OVF_CNT_LSCH7_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH7_INT_ENA  (BIT(19))
#define LEDC_OVF_CNT_LSCH7_INT_ENA_M  (BIT(19))
#define LEDC_OVF_CNT_LSCH7_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH7_INT_ENA_S  19
/* LEDC_OVF_CNT_LSCH6_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH6_INT_ENA  (BIT(18))
#define LEDC_OVF_CNT_LSCH6_INT_ENA_M  (BIT(18))
#define LEDC_OVF_CNT_LSCH6_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH6_INT_ENA_S  18
/* LEDC_OVF_CNT_LSCH5_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH5_INT_ENA  (BIT(17))
#define LEDC_OVF_CNT_LSCH5_INT_ENA_M  (BIT(17))
#define LEDC_OVF_CNT_LSCH5_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH5_INT_ENA_S  17
/* LEDC_OVF_CNT_LSCH4_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH4_INT_ENA  (BIT(16))
#define LEDC_OVF_CNT_LSCH4_INT_ENA_M  (BIT(16))
#define LEDC_OVF_CNT_LSCH4_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH4_INT_ENA_S  16
/* LEDC_OVF_CNT_LSCH3_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH3_INT_ENA  (BIT(15))
#define LEDC_OVF_CNT_LSCH3_INT_ENA_M  (BIT(15))
#define LEDC_OVF_CNT_LSCH3_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH3_INT_ENA_S  15
/* LEDC_OVF_CNT_LSCH2_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH2_INT_ENA  (BIT(14))
#define LEDC_OVF_CNT_LSCH2_INT_ENA_M  (BIT(14))
#define LEDC_OVF_CNT_LSCH2_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH2_INT_ENA_S  14
/* LEDC_OVF_CNT_LSCH1_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH1_INT_ENA  (BIT(13))
#define LEDC_OVF_CNT_LSCH1_INT_ENA_M  (BIT(13))
#define LEDC_OVF_CNT_LSCH1_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH1_INT_ENA_S  13
/* LEDC_OVF_CNT_LSCH0_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH0_INT_ENA  (BIT(12))
#define LEDC_OVF_CNT_LSCH0_INT_ENA_M  (BIT(12))
#define LEDC_OVF_CNT_LSCH0_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH0_INT_ENA_S  12
/* LEDC_DUTY_CHNG_END_LSCH7_INT_ENA : R/W ;bitpos:[11] ;default: 1'h0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA  (BIT(11))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA_M  (BIT(11))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA_S  11
/* LEDC_DUTY_CHNG_END_LSCH6_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA  (BIT(10))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA_M  (BIT(10))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA_S  10
/* LEDC_DUTY_CHNG_END_LSCH5_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA  (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_S  9
/* LEDC_DUTY_CHNG_END_LSCH4_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA  (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_S  8
/* LEDC_DUTY_CHNG_END_LSCH3_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA  (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_M  (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_S  7
/* LEDC_DUTY_CHNG_END_LSCH2_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA  (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_M  (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_S  6
/* LEDC_DUTY_CHNG_END_LSCH1_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA  (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_M  (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_S  5
/* LEDC_DUTY_CHNG_END_LSCH0_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA  (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_M  (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_S  4
/* LEDC_LSTIMER3_OVF_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER3_OVF_INT_ENA  (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_ENA_M  (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER3_OVF_INT_ENA_S  3
/* LEDC_LSTIMER2_OVF_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER2_OVF_INT_ENA  (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_ENA_M  (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER2_OVF_INT_ENA_S  2
/* LEDC_LSTIMER1_OVF_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER1_OVF_INT_ENA  (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_ENA_M  (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER1_OVF_INT_ENA_S  1
/* LEDC_LSTIMER0_OVF_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER0_OVF_INT_ENA  (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_ENA_M  (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER0_OVF_INT_ENA_S  0

#define LEDC_INT_CLR_REG          (DR_REG_LEDC_BASE + 0x00cC)
/* LEDC_OVF_CNT_LSCH7_INT_CLR : WO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH7_INT_CLR  (BIT(19))
#define LEDC_OVF_CNT_LSCH7_INT_CLR_M  (BIT(19))
#define LEDC_OVF_CNT_LSCH7_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH7_INT_CLR_S  19
/* LEDC_OVF_CNT_LSCH6_INT_CLR : WO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH6_INT_CLR  (BIT(18))
#define LEDC_OVF_CNT_LSCH6_INT_CLR_M  (BIT(18))
#define LEDC_OVF_CNT_LSCH6_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH6_INT_CLR_S  18
/* LEDC_OVF_CNT_LSCH5_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH5_INT_CLR  (BIT(17))
#define LEDC_OVF_CNT_LSCH5_INT_CLR_M  (BIT(17))
#define LEDC_OVF_CNT_LSCH5_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH5_INT_CLR_S  17
/* LEDC_OVF_CNT_LSCH4_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH4_INT_CLR  (BIT(16))
#define LEDC_OVF_CNT_LSCH4_INT_CLR_M  (BIT(16))
#define LEDC_OVF_CNT_LSCH4_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH4_INT_CLR_S  16
/* LEDC_OVF_CNT_LSCH3_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH3_INT_CLR  (BIT(15))
#define LEDC_OVF_CNT_LSCH3_INT_CLR_M  (BIT(15))
#define LEDC_OVF_CNT_LSCH3_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH3_INT_CLR_S  15
/* LEDC_OVF_CNT_LSCH2_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH2_INT_CLR  (BIT(14))
#define LEDC_OVF_CNT_LSCH2_INT_CLR_M  (BIT(14))
#define LEDC_OVF_CNT_LSCH2_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH2_INT_CLR_S  14
/* LEDC_OVF_CNT_LSCH1_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH1_INT_CLR  (BIT(13))
#define LEDC_OVF_CNT_LSCH1_INT_CLR_M  (BIT(13))
#define LEDC_OVF_CNT_LSCH1_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH1_INT_CLR_S  13
/* LEDC_OVF_CNT_LSCH0_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH0_INT_CLR  (BIT(12))
#define LEDC_OVF_CNT_LSCH0_INT_CLR_M  (BIT(12))
#define LEDC_OVF_CNT_LSCH0_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH0_INT_CLR_S  12
/* LEDC_DUTY_CHNG_END_LSCH7_INT_CLR : WO ;bitpos:[11] ;default: 1'h0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR  (BIT(11))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR_M  (BIT(11))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR_S  11
/* LEDC_DUTY_CHNG_END_LSCH6_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR  (BIT(10))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR_M  (BIT(10))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR_S  10
/* LEDC_DUTY_CHNG_END_LSCH5_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR  (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR_S  9
/* LEDC_DUTY_CHNG_END_LSCH4_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR  (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR_S  8
/* LEDC_DUTY_CHNG_END_LSCH3_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR  (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR_M  (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR_S  7
/* LEDC_DUTY_CHNG_END_LSCH2_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR  (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR_M  (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR_S  6
/* LEDC_DUTY_CHNG_END_LSCH1_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR  (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR_M  (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR_S  5
/* LEDC_DUTY_CHNG_END_LSCH0_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR  (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR_M  (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR_S  4
/* LEDC_LSTIMER3_OVF_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER3_OVF_INT_CLR  (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_CLR_M  (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER3_OVF_INT_CLR_S  3
/* LEDC_LSTIMER2_OVF_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER2_OVF_INT_CLR  (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_CLR_M  (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER2_OVF_INT_CLR_S  2
/* LEDC_LSTIMER1_OVF_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER1_OVF_INT_CLR  (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_CLR_M  (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER1_OVF_INT_CLR_S  1
/* LEDC_LSTIMER0_OVF_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER0_OVF_INT_CLR  (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_CLR_M  (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER0_OVF_INT_CLR_S  0

#define LEDC_CONF_REG          (DR_REG_LEDC_BASE + 0x00d0)
/* LEDC_CLK_EN : R/W ;bitpos:[31] ;default: 1'h0 ; */
/*description: */
#define LEDC_CLK_EN  (BIT(31))
#define LEDC_CLK_EN_M  (BIT(31))
#define LEDC_CLK_EN_V  0x1
#define LEDC_CLK_EN_S  31
/* LEDC_APB_CLK_SEL : R/W ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define LEDC_APB_CLK_SEL  0x00000003
#define LEDC_APB_CLK_SEL_M  ((LEDC_APB_CLK_SEL_V)<<(LEDC_APB_CLK_SEL_S))
#define LEDC_APB_CLK_SEL_V  0x3
#define LEDC_APB_CLK_SEL_S  0

#define LEDC_DATE_REG          (DR_REG_LEDC_BASE + 0x00FC)
/* LEDC_DATE : R/W ;bitpos:[31:0] ;default: 32'h19040200 ; */
/*description: */
#define LEDC_DATE  0xFFFFFFFF
#define LEDC_DATE_M  ((LEDC_DATE_V)<<(LEDC_DATE_S))
#define LEDC_DATE_V  0xFFFFFFFF
#define LEDC_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_LEDC_REG_H_ */
